perf_test/results/opt/recommend_empty_100_RPS.txt
Requests      [total, rate, throughput]         6000, 100.02, 99.50
Duration      [total, attack, wait]             59.993s, 59.989s, 3.192ms
Latencies     [min, mean, 50, 90, 95, 99, max]  506.8µs, 161.515ms, 3.309ms, 4.134ms, 5.008ms, 318.816ms, 30.013s
Bytes In      [total, mean]                     77597, 12.93
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           99.48%
Status Codes  [code:count]                      0:31  200:5969  
Error Set:
Get "http://localhost:8085/api/v0/recommend/home?limit=10": context deadline exceeded (Client.Timeout exceeded while awaiting headers)