perf_test/results/opt/recommend_profile_1000_RPS.txt
Requests      [total, rate, throughput]         15344, 955.03, 940.01
Duration      [total, attack, wait]             16.323s, 16.067s, 256.573ms
Latencies     [min, mean, 50, 90, 95, 99, max]  2.215ms, 93.87ms, 3.615ms, 329.716ms, 396.141ms, 493.146ms, 621.881ms
Bytes In      [total, mean]                     199472, 13.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15344  
Error Set: