perf_test/results/opt/recommend_profile_100_RPS.txt
Requests      [total, rate, throughput]         6000, 100.00, 99.90
Duration      [total, attack, wait]             1m0s, 59.999s, 4.009ms
Latencies     [min, mean, 50, 90, 95, 99, max]  552.7µs, 33.416ms, 3.331ms, 4.13ms, 4.751ms, 6.218ms, 30.006s
Bytes In      [total, mean]                     77922, 12.99
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           99.90%
Status Codes  [code:count]                      0:6  200:5994  
Error Set:
Get "http://localhost:8085/api/v0/recommend/home?limit=10": context deadline exceeded (Client.Timeout exceeded while awaiting headers)